import { Injectable, HostBinding, HostListener } from '@angular/core';

@Injectable()
export class NewsService {
  public newsEvents: {title: string, date: string, link: string}[] = [
    {title: '澳州成留学界老大学位紧缺!', date: '2017.05.06', link: '#'},
    {title: '澳州成留学界老大学位紧缺!', date: '2017.05.06', link: '#'},
    {title: '澳州成留学界老大学位紧缺!', date: '2017.05.06', link: '#'},
    {title: '澳州成留学界老大学位紧缺!', date: '2017.05.06', link: '#'},
    {title: '澳州成留学界老大学位紧缺!', date: '2017.05.06', link: '#'},
    {title: '澳州成留学界老大学位紧缺!', date: '2017.05.06', link: '#'},
    {title: '澳州成留学界老大学位紧缺!', date: '2017.05.06', link: '#'},
    {title: '澳州成留学界老大学位紧缺!', date: '2017.05.06', link: '#'},
    {title: '澳州成留学界老大学位紧缺!', date: '2017.05.06', link: '#'}];

  public cases: [string] = [
    '恭喜Pan同学190签证获批(土木工程)',
    '恭喜Pan同学190签证获批(土木工程)',
    '恭喜Pan同学190签证获批(土木工程)',
    '恭喜Pan同学190签证获批(土木工程)',
    '恭喜Pan同学190签证获批(土木工程)',
    '恭喜Pan同学190签证获批(土木工程)',
    '恭喜Pan同学190签证获批(土木工程)'];

  public newest: [string] = [
    '这实际上是一条新闻，。。。。。。。',
    '这实际上是一条新闻，。。。。。。。',
    '这实际上是一条新闻，。。。。。。。',
    '这实际上是一条新闻，。。。。。。。',
    '这实际上是一条新闻，。。。。。。。',
    '这实际上是一条新闻，。。。。。。。',
    '这实际上是一条新闻，。。。。。。。' ];

  public review: [string] = [
    '这是精彩回顾的一个部分 。。。。。',
    '这是精彩回顾的一个部分 。。。。。',
    '这是精彩回顾的一个部分 。。。。。',
    '这是精彩回顾的一个部分 。。。。。',
    '这是精彩回顾的一个部分 。。。。。',
    '这是精彩回顾的一个部分 。。。。。',
    '这是精彩回顾的一个部分 。。。。。'];

  public status = 'news';


}
